Extensions/БИТ_Доработки_НДЭ/Documents/МаркировкаТоваровИСМП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>МаркировкаТоваровИСМП</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеМаркировкаТоваровИСМП</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БИТ_АвтосозданиеДокумента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Extensions/БИТ_Доработки_НДЭ/Enums/ВидыОперацийИСМП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ВидыОперацийИСМП</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОтчетОВерификацииНанесенныхКМ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Extensions/БИТ_Доработки_НДЭ/Documents/МаркировкаТоваровИСМП/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура БИТ_ДоработкаПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("БИТ_АвтосозданиеДокумента") Тогда
		Попытка
			Объект.БИТ_АвтосозданиеДокумента = Истина;
			Объект.Операция = Перечисления.ВидыОперацийИСМП.ОтчетОВерификацииНанесенныхКМ;
			Объект.ПроизводственныйОбъект = Объект.ДокументОснование.СтруктурнаяЕдиница;
		Исключение
			Сообщить("Не удалось поставить реквизиты автоматически");
		КонецПопытки;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура БИТ_ДоработкаПриОткрытииПосле(Отказ)
	Если Объект.БИТ_АвтосозданиеДокумента И Объект.Ссылка.Пустая() Тогда
		ПодключитьОбработчикОжидания("ВыполнитьАвтозапись", 0.5, Истина);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьАвтозапись() Экспорт
	ОтключитьОбработчикОжидания("ВыполнитьАвтозапись");
	
	// Показываем статус пользователю
	Состояние("Выполняется автоматическая запись документа...");
	
	ЗаписатьДокументНаСервереАвтоматически();
	ЭтотОбъект.ОбновитьОтображениеДанных();
	ПараметрыУказанияСерий.Вставить("БИТ_АвтоПодбор", Истина);
	ПроверкаИПодборПродукцииИСМПКлиент.ОткрытьФормуПроверкиИПодбора(ЭтотОбъект, Объект.ВидПродукции, ПараметрыУказанияСерий);
КонецПроцедуры

&НаСервере
Процедура ЗаписатьДокументНаСервереАвтоматически()
	Попытка
		// 1. Если нужно с проведением:
		ЭтотОбъект.Записать();
		
		// 2. Получаем актуальный объект ИЗ ФОРМЫ
		ДокОбъект = РеквизитФормыВЗначение("Объект");
		
		// 3. Проводим уже записанный объект
		ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
		// 4. Обновляем форму
		ЗначениеВРеквизитФормы(ДокОбъект, "Объект");
	Исключение
		Сообщить("Не удалось выполнить автозапись: " + ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры
